dictonary_metro = {'Пушкинская': 0, 'Технологический институт': 0, 'Балтийская': 0, 'Сенная площадь':0, 'Технологический институт':0, \
                   'Фрунзенская': 0, 'Спасская': 0, 'Садовая': 0, 'Звенигородская': 0, 'Приморская': 1, 'Василеостровская': 1, \
                   'Лесная': 2, 'Выборгская': 2, 'Парнас': 2, 'Проспект Просвещения': 2, 'Озерки': 2, 'Удельная': 2, 'Девяткино': 3, \
                   'Гражданский проспект': 3, 'Академическая': 3, 'Политехническая': 3, 'Площадь Мужества': 3, 'Площадь Ленина': 3, \
                   'Нарвская': 4, 'Кировский завод': 4, 'Автово': 4, 'Ленинский проспект': 4, 'Проспект Ветеранов': 4, 'Новочеркасская': 5, \
                   'Ладожская': 5, 'Московские ворота': 6, 'Электросила': 6, 'Парк Победы': 6, 'Московская': 6, 'Звёздная': 6, 'Купчино':  6, \
                   'Елизаровская': 7, 'Ломоносовская': 7, 'Пролетарская': 7, 'Обухово': 7, 'Рыбацкое': 7, 'Проспект Большевиков': 7, \
                   'Улица Дыбенко': 7, 'Петроградская': 8, 'Горьковская': 8, 'Зенит': 8, 'Крестовский остров': 8, 'Чкаловская': 8, 'Спортивная': 8, \
                   'Пионерская': 9, 'Чёрная речка': 9, 'Беговая': 9, 'Комендантский проспект': 9, 'Старая Деревня': 9, 'Шушары': 9,\
                   'Обводный канал': 10, 'Волковская': 10, 'Бухарестская': 10, 'Международная': 10, 'Проспект Славы': 10, 'Дунайская': 10, \
                   'Чернышевская': 11, 'Площадь Восстания': 11, 'Владимирская': 11, 'Невский проспект': 11, 'Гостиный двор': 11, 'Маяковская': 11,\
                   'Достоевская': 11, 'Лиговский проспект': 11, 'Площадь Александра Невского': 11, 'Адмиралтейская': 11 \
}

dictonary_metro_lower = {'пушкинская': 0, 'технологический институт': 0, 'балтийская': 0, 'сенная площадь':0, 'технологический институт':0, \
                   'фрунзенская': 0, 'спасская': 0, 'садовая': 0, 'звенигородская': 0, 'приморская': 1, 'василеостровская': 1, \
                   'лесная': 2, 'выборгская': 2, 'парнас': 2, 'проспект просвещения': 2, 'озерки': 2, 'удельная': 2, 'девяткино': 3, \
                   'гражданский проспект': 3, 'академическая': 3, 'политехническая': 3, 'площадь мужества': 3, 'площадь ленина': 3, \
                   'нарвская': 4, 'кировский завод': 4, 'автово': 4, 'ленинский проспект': 4, 'проспект ветеранов': 4, 'новочеркасская': 5, \
                   'ладожская': 5, 'московские ворота': 6, 'электросила': 6, 'парк победы': 6, 'московская': 6, 'звёздная': 6, 'купчино':  6, \
                   'елизаровская': 7, 'ломоносовская': 7, 'пролетарская': 7, 'обухово': 7, 'рыбацкое': 7, 'проспект большевиков': 7, \
                   'улица дыбенко': 7, 'петроградская': 8, 'горьковская': 8, 'зенит': 8, 'крестовский остров': 8, 'чкаловская': 8, 'спортивная': 8, \
                   'пионерская': 9, 'чёрная речка': 9, 'беговая': 9, 'комендантский проспект': 9, 'старая деревня': 9, 'шушары': 9,\
                   'обводный канал': 10, 'волковская': 10, 'бухарестская': 10, 'международная': 10, 'проспект славы': 10, 'дунайская': 10, \
                   'чернышевская': 11, 'площадь восстания': 11, 'владимирская': 11, 'невский проспект': 11, 'гостиный двор': 11, 'маяковская': 11,\
                   'достоевская': 11, 'лиговский проспект': 11, 'площадь александра невского': 11, 'адмиралтейская': 11}



tuple_district = ('Адмиралтейский', 'Василеостровский', 'Выборгский', 'Калининский', 'Кировский', 'Красногвардейский', 'Московский', 'Невский', \
                  'Петроградский', 'Приморский', 'Фрунзенский', 'Центральный'
)
                
#metro =  "Международная"
#print(tuple_district[dictonary_metro[metro]])