dictonary_metro = {'Пушкинская': 0, 'Технологический институт': 0, 'Балтийская': 0, 'Сенная площадь':0, 'Технологический институт':0, \
                   'Фрунзенская': 0, 'Спасская': 0, 'Садовая': 0, 'Звенигородская': 0, 'Приморская': 1, 'Василеостровская': 1, \
                   'Лесная': 2, 'Выборгская': 2, 'Парнас': 2, 'Проспект Просвещения': 2, 'Озерки': 2, 'Удельная': 2, 'Девяткино': 3, \
                   'Гражданский проспект': 3, 'Академическая': 3, 'Политехническая': 3, 'Площадь Мужества': 3, 'Площадь Ленина': 3, \
                   'Нарвская': 4, 'Кировский завод': 4, 'Автово': 4, 'Ленинский проспект': 4, 'Проспект Ветеранов': 4, 'Новочеркасская': 5, \
                   'Ладожская': 5, 'Московские ворота': 6, 'Электросила': 6, 'Парк Победы': 6, 'Московская': 6, 'Звёздная': 6, 'Купчино':  6, \
                   'Елизаровская': 7, 'Ломоносовская': 7, 'Пролетарская': 7, 'Обухово': 7, 'Рыбацкое': 7, 'Проспект Большевиков': 7, \
                   'Улица Дыбенко': 7, 'Петроградская': 8, 'Горьковская': 8, 'Зенит': 8, 'Крестовский остров': 8, 'Чкаловская': 8, 'Спортивная': 8, \
                   'Пионерская': 9, 'Чёрная речка': 9, 'Беговая': 9, 'Комендантский проспект': 9, 'Старая Деревня': 9, 'Шушары': 9,\
                   'Обводный канал': 10, 'Волковская': 10, 'Бухарестская': 10, 'Международная': 10, 'Проспект Славы': 10, 'Дунайская': 10, \
                   'Чернышевская': 11, 'Площадь Восстания': 11, 'Владимирская': 11, 'Невский проспект': 11, 'Гостиный двор': 11, 'Маяковская': 11,\
                   'Достоевская': 11, 'Лиговский проспект': 11, 'Площадь Александра Невского': 11, 'Адмиралтейская': 11
}

tuple_district = ('Адмиралтейский', 'Василеостровский', 'Выборгский', 'Калининский', 'Кировский', 'Красногвардейский', 'Московский', 'Невский', \
                  'Петроградский', 'Приморский', 'Фрунзенский', 'Центральный'
)
                
#metro =  "Международная"
#print(tuple_district[dictonary_metro[metro]])